# Листинг 4.11.
# Создание словаря:
age = dict([['Кот матроскин', 5],['Пес Шарик',7],["Дядя Федор",12]])
# Перебор ключей:
for s in age.keys():
    print(f'!{s}: {age[s]}')
# Перебор значений:
for v in age.values():
    print(f'{v}',end='  ')
print()
# Создание словаря:
color = dict([[(255,0,0),'Красный'],[(0,255,0),'Зеленый'],[(0,0,225),"Синий"]])
# Обращение к элементам словаря:
color [(255,255,0)] = 'Желтый'
print(f'(255,0,0): {color[(255,0,0)]}')
print(f'(255,255,0): {color[(255,255,0)]}')
print(f'(0,255,0): {color.get((0,255,0))}')
print(f'(0,0,255): {color.get((0,0,255),"Белый" )}')
print(f'(255,255,255): {color.get((255,255,255),"Белый")}')
