# Листинг 5.1. Текстовые литералы
A = "Язык 'Python' отличается от языка \"Java\"."
print(A)
B = 'Язык "Java" отличается от языка \'C++\'.'
print(B)
C = "Серый\tЖелтый\tКрасный\nСиний\tБелый\tЗеленый"
print(C)
print('\\ Омар Хайям \\')
D = """ Зачем копить добро в путыне бытия?
    Кто вечно жил седь нас? Таких не видал я.
        Ведь жизнь нам в долг дана, и то - на срок недолгий,
            А то,  что в долг дано, не собственность твоя."""
print(D)
# Листинг 5.2. Использование префиквос в литералах
# Текстовый литерал без префикса:
A =