# Листинг 5.3. Создание форматированного текста
A = "Число {}, текст {} и снова число {}"
txt = A.format(123,'Python',321)
print(f'{txt}')
txt = "Число {0} - это {0: b} или {0: x}".format(42)
print(txt)
txt = "Код: {0:05d}, символ: {0:\"^5c}".format(65)
print(txt)
txt = "Число: {:_>+15.3E}".format(123.468)
print(txt)
#______________________________________________________
B = "{0:_{2}{1}s}" # {[индекс]:[заполнитель][выравнивание][ширина][тип]}
num = 6
for k in range(1,num+1): # "*" - арг 0, k = арг 1, > = арг 2
    print(B.format("*", k ,">"), end="\\") #{0:_>1s}
    print(" "*(2*(num-k)),end="/")
    print(B.format("*",k,"<"))